In [1]:
%matplotlib inline
import pandas as pd

In [2]:
# from IPython.core.display import HTML
# css = open('style-table.css').read() + open('style-notebook.css').read()
# HTML('<style>{}</style>'.format(css))

In [3]:
titles = pd.read_csv('data/titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

### How many movies are listed in the titles dataframe?

In [4]:
titles.shape[0]

244914

### What are the earliest two films listed in the titles dataframe?

In [5]:
titles.sort_values(by=['year']).head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [6]:
titles[titles['title']=='Hamlet'].shape[0]

20

### How many movies are titled "North by Northwest"?

In [7]:
titles[titles['title']=='North by Northwest'].shape[0]

1

### When was the first movie titled "Hamlet" made?

In [8]:
titles[titles['title']=='Hamlet'].sort_values(by=['year']).head(1)

        title  year
52521  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [9]:
titles[titles['title']=='Treasure Island'].sort_values(['year'])

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [10]:
titles[titles.year==1950].shape[0]

1113

### How many movies were made in the year 1960?

In [11]:
titles[titles.year==1960].shape[0]

1549

### How many movies were made from 1950 through 1959?

In [12]:
titles[(titles.year <=1959) & (titles.year >=1950)].shape[0]

12934

### In what years has a movie titled "Batman" been released?

In [13]:
titles[titles.title=='Batman'].year

39349     1943
240896    1989
Name: year, dtype: int64

### How many roles were there in the movie "Inception"?

In [14]:
cast = pd.read_csv('data\cast.csv')
#cast.head()

In [15]:
cast[cast.title=='Inception'].shape[0]

78

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [16]:
cast[(cast.title=='Inception') & (cast.n == 'NaN')].shape[0]

C:\Users\rb5062\Anaconda3\lib\site-packages\pandas\core\ops\array_ops.py:253: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  res_values = method(rvalues)

0

### But how many roles in the movie "Inception" did receive an "n" value?

In [17]:
cast[(cast.title=='Inception') & (cast.n != 'NaN')].shape[0]

78

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [18]:
cast[(cast.title=='North by Northwest')].dropna().sort_values(['n'])

,title,year,name,type,character,n
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3518333,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1457165,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3157232,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
3048272,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1695173,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1275337,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2447081,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1811387,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
665768,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2295714,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
464736,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1508344,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
206471,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1384780,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [19]:
cast[(cast.title=='Sleuth') & (cast.year==1972)].dropna().sort_values(['n'])

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [20]:
cast[(cast.title=='Sleuth') & (cast.year==2007)].dropna().sort_values(['n'])

          title  year           name   type    character    n
326774   Sleuth  2007  Michael Caine  actor       Andrew  1.0
1293634  Sleuth  2007       Jude Law  actor         Milo  2.0
1805907  Sleuth  2007  Harold Pinter  actor  Man on T.V.  3.0

### How many roles were credited in the silent 1921 version of Hamlet?

In [21]:
cast[(cast.title=='Hamlet') & (cast.year==1921)].character.shape[0]

9

### How many roles were credited in Branaghâ€™s 1996 Hamlet?

In [22]:
cast[(cast.title=='Hamlet') & (cast.year==1996)].character.shape[0]

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [23]:
cast[(cast.character=='Hamlet')].shape[0]

96

### How many people have played an "Ophelia"?

In [24]:
cast[(cast.character=='Ophelia')].name.unique().shape[0]

115

### How many people have played a role called "The Dude"?

In [25]:
cast[(cast.character=='The Dude')].shape[0]

19

### How many people have played a role called "The Stranger"?

In [26]:
cast[(cast.character=='The Strange')].name.unique().shape[0]

0

### How many roles has Sidney Poitier played throughout his career?

In [27]:
cast[(cast.name=='Sidney Poitier')].character.shape[0]

43

### How many roles has Judi Dench played?

In [28]:
cast[(cast.name=='Judi Dench')].character.shape[0]

55

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [29]:
cast[(cast.name=='Cary Grant') & (cast.year >=1940) & (cast.year<=1949) & (cast.n==2)].sort_values(['year']).shape[0]

2

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [30]:
cast[(cast.name=='Cary Grant') & (cast.year >=1940) & (cast.year<=1949) & (cast.n==1)].sort_values(['year']).shape[0]

18

### How many roles were available for actors in the 1950s?

In [31]:
cast[(cast.year >=1950) & (cast.year<=1959) &(cast.type=='actor')].shape[0]

157738

### How many roles were available for actresses in the 1950s?

In [32]:
cast[(cast.year >=1950) & (cast.year<=1959) &(cast.type=='actress')].shape[0]

57733

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [33]:
cast[(cast.n==1) & (cast.year <1980)].shape[0]

63957

### How many non-leading roles were available through from the beginning of film history through 1980?

In [34]:
cast[(cast.n!=1) & (cast.year <1980)].shape[0]

1095378

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [35]:
cast[(pd.isnull(cast.n)) & (cast.year <1980)].shape[0]

443881